## staging: quicksight
**✅ &nbsp; Terraform Init:** `success`
**✅ &nbsp; Terraform Validate:** `success`
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`
**✅ &nbsp; Conftest:** `success` 

```terraform
Plan: 2 to add, 0 to change, 0 to destroy
```

<details>
<summary>Show summary</summary>

| CHANGE |                           NAME                            |
|--------|-----------------------------------------------------------|
| add    | `aws_quicksight_data_set.notifications_refreshed`         |
|        | `aws_quicksight_refresh_schedule.notifications-refreshed` |


</details>


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
18:48:24.882 STDOUT terraform:   + create
18:48:24.882 STDOUT terraform: Terraform will perform the following actions:
18:48:24.883 STDOUT terraform:   # aws_quicksight_data_set.notifications_refreshed will be created
18:48:24.883 STDOUT terraform:   + resource "aws_quicksight_data_set" "notifications_refreshed" {
18:48:24.883 STDOUT terraform:       + arn            = (known after apply)
18:48:24.883 STDOUT terraform:       + aws_account_id = (known after apply)
18:48:24.883 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
18:48:24.883 STDOUT terraform:       + id             = (known after apply)
18:48:24.883 STDOUT terraform:       + import_mode    = "SPICE"
18:48:24.883 STDOUT terraform:       + name           = "Notifications Refreshing"
18:48:24.883 STDOUT terraform:       + output_columns = (known after apply)
18:48:24.883 STDOUT terraform:       + region         = "ca-central-1"
18:48:24.883 STDOUT terraform:       + tags_all       = (known after apply)
18:48:24.883 STDOUT terraform:       + data_set_usage_configuration (known after apply)
18:48:24.883 STDOUT terraform:       + logical_table_map {
18:48:24.883 STDOUT terraform:           + alias                = "Notifications with Services"
18:48:24.883 STDOUT terraform:           + logical_table_map_id = "notifications-with-services"
18:48:24.883 STDOUT terraform:           + data_transforms (known after apply)
18:48:24.883 STDOUT terraform:           + source {
18:48:24.883 STDOUT terraform:               + data_set_arn      = (known after apply)
18:48:24.883 STDOUT terraform:               + physical_table_id = (known after apply)
18:48:24.883 STDOUT terraform:               + join_instruction {
18:48:24.883 STDOUT terraform:                   + left_operand  = "logical-notifications"
18:48:24.884 STDOUT terraform:                   + on_clause     = "notifications.service_id = services.id"
18:48:24.884 STDOUT terraform:                   + right_operand = "logical-services"
18:48:24.884 STDOUT terraform:                   + type          = "INNER"
18:48:24.884 STDOUT terraform:                   + left_join_key_properties (known after apply)
18:48:24.884 STDOUT terraform:                   + right_join_key_properties (known after apply)
18:48:24.884 STDOUT terraform:                 }
18:48:24.884 STDOUT terraform:             }
18:48:24.884 STDOUT terraform:         }
18:48:24.884 STDOUT terraform:       + logical_table_map {
18:48:24.884 STDOUT terraform:           + alias                = "Notifications"
18:48:24.884 STDOUT terraform:           + logical_table_map_id = "logical-notifications"
18:48:24.884 STDOUT terraform:           + data_transforms (known after apply)
18:48:24.884 STDOUT terraform:           + source {
18:48:24.884 STDOUT terraform:               + data_set_arn      = (known after apply)
18:48:24.884 STDOUT terraform:               + physical_table_id = "notifications"
18:48:24.884 STDOUT terraform:               + join_instruction (known after apply)
18:48:24.884 STDOUT terraform:             }
18:48:24.884 STDOUT terraform:         }
18:48:24.884 STDOUT terraform:       + logical_table_map {
18:48:24.884 STDOUT terraform:           + alias                = "Services"
18:48:24.884 STDOUT terraform:           + logical_table_map_id = "logical-services"
18:48:24.884 STDOUT terraform:           + data_transforms (known after apply)
18:48:24.884 STDOUT terraform:           + source {
18:48:24.884 STDOUT terraform:               + data_set_arn      = (known after apply)
18:48:24.884 STDOUT terraform:               + physical_table_id = "services"
18:48:24.884 STDOUT terraform:               + join_instruction (known after apply)
18:48:24.884 STDOUT terraform:             }
18:48:24.884 STDOUT terraform:         }
18:48:24.884 STDOUT terraform:       + permissions {
18:48:24.884 STDOUT terraform:           + actions   = [
18:48:24.884 STDOUT terraform:               + "quicksight:CancelIngestion",
18:48:24.884 STDOUT terraform:               + "quicksight:CreateIngestion",
18:48:24.885 STDOUT terraform:               + "quicksight:DeleteDataSet",
18:48:24.885 STDOUT terraform:               + "quicksight:DescribeDataSet",
18:48:24.885 STDOUT terraform:               + "quicksight:DescribeDataSetPermissions",
18:48:24.885 STDOUT terraform:               + "quicksight:DescribeIngestion",
18:48:24.885 STDOUT terraform:               + "quicksight:ListIngestions",
18:48:24.885 STDOUT terraform:               + "quicksight:PassDataSet",
18:48:24.885 STDOUT terraform:               + "quicksight:UpdateDataSet",
18:48:24.885 STDOUT terraform:               + "quicksight:UpdateDataSetPermissions",
18:48:24.885 STDOUT terraform:             ]
18:48:24.885 STDOUT terraform:           + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-owners"
18:48:24.885 STDOUT terraform:         }
18:48:24.885 STDOUT terraform:       + permissions {
18:48:24.885 STDOUT terraform:           + actions   = [
18:48:24.885 STDOUT terraform:               + "quicksight:DescribeDataSet",
18:48:24.885 STDOUT terraform:               + "quicksight:DescribeDataSetPermissions",
18:48:24.885 STDOUT terraform:               + "quicksight:DescribeIngestion",
18:48:24.885 STDOUT terraform:               + "quicksight:ListIngestions",
18:48:24.885 STDOUT terraform:               + "quicksight:PassDataSet",
18:48:24.885 STDOUT terraform:             ]
18:48:24.885 STDOUT terraform:           + principal = "arn:aws:quicksight:ca-central-1:239043911459:group/default/quicksight-dataset-viewers"
18:48:24.885 STDOUT terraform:         }
18:48:24.885 STDOUT terraform:       + physical_table_map {
18:48:24.885 STDOUT terraform:           + physical_table_map_id = "notifications"
18:48:24.885 STDOUT terraform:           + relational_table {
18:48:24.885 STDOUT terraform:               + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
18:48:24.885 STDOUT terraform:               + name            = "notifications"
18:48:24.885 STDOUT terraform:                 # (2 unchanged attributes hidden)
18:48:24.885 STDOUT terraform:               + input_columns {
18:48:24.885 STDOUT terraform:                   + name = "id"
18:48:24.886 STDOUT terraform:                   + type = "STRING"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "billable_units"
18:48:24.886 STDOUT terraform:                   + type = "INTEGER"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "created_at"
18:48:24.886 STDOUT terraform:                   + type = "DATETIME"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "queue_name"
18:48:24.886 STDOUT terraform:                   + type = "STRING"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "sent_at"
18:48:24.886 STDOUT terraform:                   + type = "DATETIME"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "notification_status"
18:48:24.886 STDOUT terraform:                   + type = "STRING"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "notification_type"
18:48:24.886 STDOUT terraform:                   + type = "STRING"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "updated_at"
18:48:24.886 STDOUT terraform:                   + type = "DATETIME"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.886 STDOUT terraform:                   + name = "job_id"
18:48:24.886 STDOUT terraform:                   + type = "STRING"
18:48:24.886 STDOUT terraform:                 }
18:48:24.886 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "api_key_id"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "key_id"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "service_id"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "template_id"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "reference"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "sms_total_message_price"
18:48:24.887 STDOUT terraform:                   + type = "DECIMAL"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "sms_total_carrier_fee"
18:48:24.887 STDOUT terraform:                   + type = "DECIMAL"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "sms_iso_country_code"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.887 STDOUT terraform:                 }
18:48:24.887 STDOUT terraform:               + input_columns {
18:48:24.887 STDOUT terraform:                   + name = "sms_carrier_name"
18:48:24.887 STDOUT terraform:                   + type = "STRING"
18:48:24.888 STDOUT terraform:                 }
18:48:24.888 STDOUT terraform:               + input_columns {
18:48:24.888 STDOUT terraform:                   + name = "sms_message_encoding"
18:48:24.888 STDOUT terraform:                   + type = "STRING"
18:48:24.888 STDOUT terraform:                 }
18:48:24.888 STDOUT terraform:               + input_columns {
18:48:24.888 STDOUT terraform:                   + name = "sms_origination_phone_number"
18:48:24.888 STDOUT terraform:                   + type = "STRING"
18:48:24.888 STDOUT terraform:                 }
18:48:24.888 STDOUT terraform:             }
18:48:24.888 STDOUT terraform:           + s3_source (known after apply)
18:48:24.888 STDOUT terraform:         }
18:48:24.888 STDOUT terraform:       + physical_table_map {
18:48:24.888 STDOUT terraform:           + physical_table_map_id = "services"
18:48:24.888 STDOUT terraform:           + relational_table {
18:48:24.888 STDOUT terraform:               + data_source_arn = "arn:aws:quicksight:ca-central-1:239043911459:datasource/NotificationCanadaCastaging"
18:48:24.888 STDOUT terraform:               + name            = "services"
18:48:24.888 STDOUT terraform:                 # (2 unchanged attributes hidden)
18:48:24.888 STDOUT terraform:               + input_columns {
18:48:24.888 STDOUT terraform:                   + name = "id"
18:48:24.888 STDOUT terraform:                   + type = "STRING"
18:48:24.888 STDOUT terraform:                 }
18:48:24.888 STDOUT terraform:               + input_columns {
18:48:24.888 STDOUT terraform:                   + name = "active"
18:48:24.888 STDOUT terraform:                   + type = "INTEGER"
18:48:24.888 STDOUT terraform:                 }
18:48:24.888 STDOUT terraform:               + input_columns {
18:48:24.888 STDOUT terraform:                   + name = "restricted"
18:48:24.888 STDOUT terraform:                   + type = "INTEGER"
18:48:24.888 STDOUT terraform:                 }
18:48:24.888 STDOUT terraform:               + input_columns {
18:48:24.888 STDOUT terraform:                   + name = "research_mode"
18:48:24.888 STDOUT terraform:                   + type = "INTEGER"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:               + input_columns {
18:48:24.889 STDOUT terraform:                   + name = "count_as_live"
18:48:24.889 STDOUT terraform:                   + type = "INTEGER"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:               + input_columns {
18:48:24.889 STDOUT terraform:                   + name = "go_live_at"
18:48:24.889 STDOUT terraform:                   + type = "DATETIME"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:               + input_columns {
18:48:24.889 STDOUT terraform:                   + name = "name"
18:48:24.889 STDOUT terraform:                   + type = "STRING"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:               + input_columns {
18:48:24.889 STDOUT terraform:                   + name = "message_limit"
18:48:24.889 STDOUT terraform:                   + type = "INTEGER"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:               + input_columns {
18:48:24.889 STDOUT terraform:                   + name = "rate_limit"
18:48:24.889 STDOUT terraform:                   + type = "INTEGER"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:               + input_columns {
18:48:24.889 STDOUT terraform:                   + name = "sms_daily_limit"
18:48:24.889 STDOUT terraform:                   + type = "INTEGER"
18:48:24.889 STDOUT terraform:                 }
18:48:24.889 STDOUT terraform:             }
18:48:24.889 STDOUT terraform:           + s3_source (known after apply)
18:48:24.889 STDOUT terraform:         }
18:48:24.889 STDOUT terraform:     }
18:48:24.889 STDOUT terraform:   # aws_quicksight_refresh_schedule.notifications-refreshed will be created
18:48:24.889 STDOUT terraform:   + resource "aws_quicksight_refresh_schedule" "notifications-refreshed" {
18:48:24.889 STDOUT terraform:       + arn            = (known after apply)
18:48:24.889 STDOUT terraform:       + aws_account_id = (known after apply)
18:48:24.889 STDOUT terraform:       + data_set_id    = "notifications-refreshed"
18:48:24.890 STDOUT terraform:       + id             = (known after apply)
18:48:24.890 STDOUT terraform:       + region         = "ca-central-1"
18:48:24.890 STDOUT terraform:       + schedule_id    = "schedule-notifications"
18:48:24.890 STDOUT terraform:       + schedule {
18:48:24.890 STDOUT terraform:           + refresh_type          = "INCREMENTAL_REFRESH"
18:48:24.890 STDOUT terraform:           + start_after_date_time = (known after apply)
18:48:24.890 STDOUT terraform:           + schedule_frequency {
18:48:24.890 STDOUT terraform:               + interval        = "DAILY"
18:48:24.890 STDOUT terraform:               + time_of_the_day = "07:50"
18:48:24.890 STDOUT terraform:               + timezone        = (known after apply)
18:48:24.890 STDOUT terraform:             }
18:48:24.890 STDOUT terraform:         }
18:48:24.890 STDOUT terraform:     }
18:48:24.890 STDOUT terraform: Plan: 2 to add, 0 to change, 0 to destroy.
18:48:24.890 STDOUT terraform: ─────────────────────────────────────────────────────────────────────────────
18:48:24.890 STDOUT terraform: Saved the plan to: plan.tfplan
18:48:24.890 STDOUT terraform: To perform exactly these actions, run the following command to apply:
18:48:24.890 STDOUT terraform:     terraform apply "plan.tfplan"

```

</details>

<details>
<summary>Show Conftest results</summary>

```sh
WARN - plan.json - main - Missing Common Tags: ["aws_cloudformation_stack.sms-usage-notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight-s3-usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_ec2"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_policy.quicksight_vpc_connection_iam"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.quicksight"]
WARN - plan.json - main - Missing Common Tags: ["aws_iam_role.vpc_connection_role"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.jobs"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.login_events"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.notifications_refreshed"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.organisation"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.services"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.template-category-history"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.templates"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_set.users"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_data_source.s3_sms_usage"]
WARN - plan.json - main - Missing Common Tags: ["aws_quicksight_vpc_connection.rds"]
WARN - plan.json - main - Missing Common Tags: ["aws_s3_object.manifest_file"]

40 tests, 19 passed, 21 warnings, 0 failures, 0 exceptions

```

</details>
